cask_args appdir: '/Applications'

tap 'caskroom/cask'

brew 'git', args: ['without-completions']
brew 'git-flow'

brew 'wget'
brew 'ack'
bree 'bat'
brew 'prettyping'

brew 'ffmpeg'
brew 'gcovr'
brew 'htop-osx'
brew 'httperf'
brew 'nmap'
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'swiftlint'

brew 'keybase'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'

brew 'nvm'

# dev tools
cask 'iterm2'
cask 'webstorm'
cask 'pycharm'
cask 'heroku-toolbelt'
cask 'docker'
cask 'visual-studio-code'

cask 'alfred'
cask 'appcleaner'
cask '1password'

cask 'betterzip'
cask 'betterzipql'

cask 'slate'

cask 'controlplane'

cask 'disk-inventory-x'

cask 'dropbox'
cask 'google-drive'

# browsers
cask 'firefox'
cask 'google-chrome'

# communication
cask 'skype'
cask 'slack'
cask 'telegram'
cask 'whatsapp'

# music
cask 'spotify'
cask 'sonos'

cask 'gpgtools'
cask 'imageoptim'

cask 'kismac'

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

cask 'sequel-pro'
cask 'vlc'

