cask_args appdir: '/Applications'

tap 'caskroom/cask'

brew 'git', args: ['without-completions']
brew 'git-flow'

brew 'mas'

brew 'wget'
brew 'ack'
bree 'bat'
brew 'prettyping'

brew 'gcovr'
brew 'htop'
brew 'httperf'
brew 'nmap'
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'swiftlint'
brew 'gettext', link: true


brew 'ctop'

brew 'keybase'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'

brew 'nvm'

brew 'speedtest_cli'

# dev tools
cask 'iterm2'
cask 'webstorm'
cask 'pycharm'
cask 'heroku-toolbelt'
cask 'docker'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'teamviewwe'
cask 'kismac'
cask 'gpgtools'
cask 'imageoptim'
cask 'poedit'
brew 'httpie'


cask 'alfred'
cask 'appcleaner'
cask '1password'

cask 'betterzip'
cask 'betterzipql'

cask 'slate'

cask 'controlplane'

cask 'disk-inventory-x'

# drive
cask 'dropbox'
cask 'google-drive'

# browsers
cask 'firefox'
cask 'google-chrome'

# communication
cask 'skype'
cask 'slack'
cask 'telegram'
cask 'whatsapp'

# music
cask 'spotify'
cask 'sonos'

# design
cask 'sketch'
cask 'adobe-creative-cloud'

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'

# DB
cask 'sequel-pro'
cask 'sqlitebrowser'
cask 'mongohub'

# video
brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx', 'with-x265']
cask 'vlc'
cask 'handbrake'

# font
cask 'skyfonts'

# ftp
cask 'cyberduck'
cask 'filezilla'

# crypto
cask 'electrum'

mas 'Airmail 3', id: 918858936
mas 'Deliveries', id: 924726344
mas 'Frank DeLoupe', id: 530458789
mas 'Harvest', id: 506189836
mas 'iFlicks 2', id: 731062389
mas 'iMovie', id: 408981434
mas 'iStat Menus', id: 1319778037
mas 'Screens 4', id: 1224268771
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835